Revit 2027 API
RibbonButtonOptions Properties
The RibbonButtonOptions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
RibbonButtonOptions Class
Autodesk.Revit.UI Namespace